//گۆڕینی ژمارەی کوردی بۆ ئینگلیزی#

function convertToEng(num) {
  //١- دروست کردنی ئۆبجێکتێک بۆ ژمارەکان
  const numbers = {
    '١': '1',
    '٢': '2',
    '٣': '3',
    '٤': '4',
    '٥': '5',
    '٦': '6',
    '٧': '7',
    '٨': '8',
    '٩': '9',
    '٠': '0',
  };
  //٢-کلیلەکەی ژمارە کوردیەکانە نرخەکەشی ژمارەی ئینگلیزی
  //٣- کاتێک ویستمان ژمارە ئینگلیزیەکە وەرگرینەوە  ژمارە کوردیەکەی پێ ئەدەین وەک کلیلێک

  //split() ٤- جاکردنەوەی ژمارەکان لەیەکتر لەڕێگەی
  num += '';
  // ٥- ماپ کردنی ژمارەکان  ماپیش وەک لووپ ئیشەکات ئەتوانیت بە لووپ بیکەیت
  var result = num
    .split('')
    .map((x) => {
      if (x == '.') return x;
      //پێویستمان بە لووپ کردنی ئۆبجێکتەکەمان نیە
      // ٧- بەراوردکردنی کلیلی ئۆبجێکتەکەمان لەگەڵ ژمارە کوردیەکە
      //٨- ئەگەر ئەو کلیلە هەبوو ئەوا ژمارە ئینگلیزیەکە ئەگەڕێنینەوە
      if (numbers.hasOwnProperty(x)) {
        return numbers[x];
      }
    })
    .join('');
  // بە کاربهێنین بۆ ئەوەی ئەڕەیەکەمان بۆ بکات بە سترین join()  ٩- ئەبێت

  // Number() ١٠- سترینگەکەشمان ئەکەین بە ژمارە لەڕێگەی
  return Number(result);
}

//گۆڕینی ژمارەی ئینگلیزی بۆ کوردی#
function convertToKrd(num) {
  //١- ئەو ئۆبژێکتەی هەمانە پێچەوانەی ئەکەینەوە کلیلەکان ئەکەین بە ئتنگلیزی و نرخەکەی ئەکەین بە کوردی
  //١- دروست کردنی ئۆبجێکتێک بۆ ژمارەکان
  const numbers = {
    1: '١',
    2: '٢',
    3: '٣',
    4: '٤',
    5: '٥',
    6: '٦',
    7: '٧',
    8: '٨',
    9: '٩',
    0: '٠',
  };
  //٢-کلیلەکەی ژمارە کوردیەکانە نرخەکەشی ژمارەی ئینگلیزی
  //٣- کاتێک ویستمان ژمارە ئینگلیزیەکە وەرگرینەوە  ژمارە کوردیەکەی پێ ئەدەین وەک کلیلێک

  //split() ٤- جاکردنەوەی ژمارەکان لەیەکتر لەڕێگەی
  num += '';
  // ٥- ماپ کردنی ژمارەکان  ماپیش وەک لووپ ئیشەکات ئەتوانیت بە لووپ بیکەیت
  var result = num
    .split('')
    .map((x) => {
      //پێویستمان بە لووپ کردنی ئۆبجێکتەکەمان نیە
      if (x == '.') return x;
      if (numbers.hasOwnProperty(x)) {
        // ٧- بەراوردکردنی کلیلی ئۆبجێکتەکەمان لەگەڵ ژمارە کوردیەکە
        //٨- ئەگەر ئەو کلیلە هەبوو ئەوا ژمارە ئینگلیزیەکە ئەگەڕێنینەوە
        return numbers[x];
      }
    })
    .join('');
  // بە کاربهێنین بۆ ئەوەی ئەڕەیەکەمان بۆ بکات بە سترین join()  ٩- ئەبێت

  //٢- پێویستە لەجیاتی ژمارە تێکست بگەڕێنینەوە
  return result;
}

module.exports = {
  convertToEng,
  convertToKrd,
};
